function bonusScore(input) {

    let number = Number(input[0]);
    let bonus = 0;

    if (number <= 100) {
        bonus = 5;
    } else if (number <= 1000) {
        bonus = 0.20 * number;
    } else {
        (number >= 1000)
        bonus = number * 0.10;
    }

    if (number % 2 === 0) {
        bonus = bonus + 1;
    } else if (number % 10 === 5) {
        bonus = bonus + 2;
    }
    console.log(bonus);
    console.log(bonus + number);
}

bonusScore(["2703"])

// Дадено е цяло число – начален брой точки.
// Върху него се начисляват бонус точки по правилата, описани по-долу.
// Да се напише функция, която пресмята бонус точките,
// които получава числото и общия брой точки (числото + бонуса).
// · Ако числото е до 100 включително, бонус точките са 5.
// · Ако числото е по-голямо от 100, бонус точките са 20% от числото.
// · Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
// · Допълнителни бонус точки (начисляват се отделно от предходните):
// o За четно число дават + 1 т.
// o За число, което завършва на 5 дават + 2 т.